name: "aligned"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [-1, -1]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [-1, -1]
  },
  {
    name: "pixel_values"
    data_type: TYPE_FP32
    dims: [-1, 3, 224, 224]
  }
]

output [
  {
    name: "embedding"
    data_type: TYPE_FP32
    dims: [-1, -1]   # concat of BERT(768) + DINO(768)
  }
]
